{
    "work": {
        "title": "Travail.",
        "rancy": "Projet freelance pour RancyHotels où j'ai travaillé sur le site principal (WordPress) et le tableau de bord de réservation (Laravel et Filament).",
        "paulromhosting": "Projet freelance pour paulromhosting où j'ai transformé le logiciel <strong>Pterodactyl.io</strong> en une boutique d'hébergement de jeux avec un système de crédits.",
        "linksevent": "Projet freelance pour links event group. Nous avons travaillé sur l'espace client et l'espace administrateur avec Next.js, et l'API avec Laravel.",
        "walkincity": "Un projet amusant permettant une promenade virtuelle dans des villes pour explorer des lieux en ligne gratuitement.",
        "hamzaOS": "Clone de ma configuration (Linux) Debian 12 KDE en tant que WebGUI, entièrement côté client, rien côté serveur."
    },
    "experience": {
        "title": "Expérience.",
        "digitalbaba": {
            "descriptions": {
                "1": "Travaillé sur plusieurs projets MERN et Full-stack",
                "2": "Contribué avec d'autres développeurs"
            }
        },
        "greyweb": {
            "descriptions": {
                "1": "Refonte du tableau de bord client avec ReactJS et Laravel",
                "2": "Intégré les APIs de <a href=\"https://pterodactyl.io\">pterodactyl.io</a> et <a href=\"https://timeweb.cloud\">timeweb.cloud</a> au backend avec Laravel.",
                "3": "Contribution au tableau de bord frontend avec VueJS 3."
            }
        },
        "ajicod": {
            "descriptions": {
                "1": "Collaboré avec une équipe de développeurs pour créer des solutions web modernes et conviviales",
                "2": "Intégration de passerelles de paiement telles que CMI / Paypal / Stripe et Youcan Pay."
            }
        }
    },
    "profile": {
        "desktop": "Bureau",
        "resume": "CV"
    },
    "footer": {
        "made_with": "Fait avec"
    },
    "aboutme": {
        "title": "À propos de moi",
        "0": "Je m'appelle <0>{{name}}</0>, j'ai <1>{{age}}</1> ans et je viens de <2>{{country}}</2>.",
        "1": "En <0>2020</0>, j'ai commencé ma carrière en tant qu'<1>administrateur Linux</1>, ce qui a déclenché ma passion pour le <2>DevOps</2> et le <3>développement web</3>. Aujourd'hui, en tant que <4>développeur full-stack</4> avec plus de deux ans d'expérience, je me spécialise dans la création de sites web et d'applications web conviviaux en utilisant des technologies modernes.",
        "2": "Langues",
        "3": "Frameworks"
    },
    "opensource": {
        "title": "OpenSource."
    },
    "country": "Maroc"
}
