[{"file":"activity-watcher.md","title":"ActivityWatch: An Open-Source Time Tracking Tool","slug":"activity-watcher","categories":["Time Management","Free & OpenSource"],"description":"ActivityWatch is a powerful open-source time tracking application designed to give you actionable insights into your daily activities","published_at":"2025-01-21"},{"file":"nginx-proxy-manager.md","title":"Nginx Proxy Manager: Web Server Management","slug":"nginx-proxy-manager","categories":["Server","Free & OpenSource"],"description":"Managing web servers and configuring proxies can be a daunting task, especially for those without deep technical knowledge. Nginx Proxy Manager (NPM) simplifies this process by offering a user-friendly interface to configure and manage reverse proxies, SSL certificates, and redirections. This blog post explores what Nginx Proxy Manager is, its features, and how to get started with it","published_at":"2025-01-21"},{"file":"pi-hole.md","title":"Pi-hole: The Ultimate Network Ad Blocker","slug":"pi-hole","categories":["Server","Networking","Security","OpenSource"],"description":"Pi-hole, a network-level ad blocker that acts as a DNS sinkhole, blocking ads for every device connected to your network. Unlike browser-based ad blockers, Pi-hole provides protection across your entire network, ensuring a cleaner, faster, and more private online experience.","published_at":"2025-01-22"},{"file":"self-invoking-functions-php.md","title":"Self-invoking functions in php","slug":"self-invoking-functions-php","categories":["Programming"],"description":"Self-invoking functions, also known as Immediately Invoked Function Expressions (IIFEs), are a common pattern in programming languages like JavaScript. However, in PHP, they are less discussed but equally useful in certain scenarios. Let’s dive into what self-invoking functions are, how they work in PHP, and why you might use them","published_at":"2025-01-23"},{"file":"wg-easy.md","title":"WireGuard Easy (wg-easy): A Simple WireGuard VPN Server Web UI","slug":"wg-easy","categories":["Server","VPN","Networking","Security","OpenSource"],"description":"WireGuard Easy (wg-easy) is a user-friendly web interface for managing a WireGuard VPN server. This tool simplifies the process of setting up and managing a WireGuard VPN server through an intuitive web UI, making it accessible even for users without extensive networking knowledge.","published_at":"2025-01-23"},{"file":"firefly-iii.md","title":"Firefly III: The Open-Source Personal Finance Manager You Need","slug":"firefly-iii","categories":["Server","Free & OpenSource","Finance"],"description":"Managing personal finances can be a daunting task, especially when juggling multiple bank accounts, credit cards, and expenses. While many commercial finance management tools exist, they often come with subscription fees, privacy concerns, or limited customization options. This is where Firefly III shines—a powerful, open-source personal finance manager designed to give you full control over your financial data.","published_at":"2025-04-06"}]